Revit 2026 API

# MEPCurveTypePreferredJunctionType Property

---

The preferred junction type of the MEP curve type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public JunctionType PreferredJunctionType { get; set; }
```
```vb
Public Property PreferredJunctionType As JunctionType
	Get
	Set
```
```cpp
public:
property JunctionType PreferredJunctionType {
	JunctionType get ();
	void set (JunctionType value);
}
```
```fsharp
member PreferredJunctionType : JunctionType with get, set
```

#### Property Value

JunctionType

Use RoutingPreferenceManager to set this property for PipeType MEPCurves.

#### Reference

MEPCurveType Class

Autodesk.Revit.DB Namespace